MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F6011/mcu.h
/* C1TX2EID */
/* Bitname _EID6 cannot be defined because it is used by more than one SFR */
/* Bitname _EID7 cannot be defined because it is used by more than one SFR */
/* Bitname _EID8 cannot be defined because it is used by more than one SFR */
/* Bitname _EID9 cannot be defined because it is used by more than one SFR */
/* Bitname _EID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID11 cannot be defined because it is used by more than one SFR */
/* Bitname _EID12 cannot be defined because it is used by more than one SFR */
/* Bitname _EID13 cannot be defined because it is used by more than one SFR */
/* Bitname _EID14 cannot be defined because it is used by more than one SFR */
/* Bitname _EID15 cannot be defined because it is used by more than one SFR */
/* Bitname _EID16 cannot be defined because it is used by more than one SFR */
/* Bitname _EID17 cannot be defined because it is used by more than one SFR */
/* Bitname _EID13_6 cannot be defined because it is used by more than one SFR */
/* Bitname _EID17_14 cannot be defined because it is used by more than one SFR */

/* C1TX2DLC */
/* Bitname _DLC cannot be defined because it is used by more than one SFR */
/* Bitname _TXRB0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXRB1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXRTR cannot be defined because it is used by more than one SFR */
/* Bitname _EID0 cannot be defined because it is used by more than one SFR */
/* Bitname _EID1 cannot be defined because it is used by more than one SFR */
/* Bitname _EID2 cannot be defined because it is used by more than one SFR */
/* Bitname _EID3 cannot be defined because it is used by more than one SFR */
/* Bitname _EID4 cannot be defined because it is used by more than one SFR */
/* Bitname _EID5 cannot be defined because it is used by more than one SFR */
/* Bitname _EID5_0 cannot be defined because it is used by more than one SFR */

/* C1TX2B1 */
/* Bitname _TXB2D00 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D01 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D02 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D03 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D04 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D05 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D06 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D07 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D10 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D11 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D12 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D13 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D14 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D15 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D16 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D17 cannot be defined because it is used by more than one SFR */

/* C1TX2B2 */
/* Bitname _TXB2D20 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D21 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D22 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D23 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D24 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D25 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D26 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D27 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D30 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D31 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D32 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D33 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D34 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D35 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D36 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D37 cannot be defined because it is used by more than one SFR */

/* C1TX2B3 */
#define _TX2B2D40 C1TX2B3bits.TX2B2D40
#define _TX2B2D41 C1TX2B3bits.TX2B2D41
#define _TX2B2D42 C1TX2B3bits.TX2B2D42
#define _TX2B2D43 C1TX2B3bits.TX2B2D43
#define _TX2B2D44 C1TX2B3bits.TX2B2D44
#define _TX2B2D45 C1TX2B3bits.TX2B2D45
#define _TX2B2D46 C1TX2B3bits.TX2B2D46
#define _TX2B2D47 C1TX2B3bits.TX2B2D47
/* Bitname _TXB2D50 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D51 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D52 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D53 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D54 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D55 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D56 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D57 cannot be defined because it is used by more than one SFR */

/* C1TX2B4 */
#define _TX2B2D60 C1TX2B4bits.TX2B2D60
#define _TX2B2D61 C1TX2B4bits.TX2B2D61
#define _TX2B2D62 C1TX2B4bits.TX2B2D62
#define _TX2B2D63 C1TX2B4bits.TX2B2D63
#define _TX2B2D64 C1TX2B4bits.TX2B2D64
#define _TX2B2D65 C1TX2B4bits.TX2B2D65
#define _TX2B2D66 C1TX2B4bits.TX2B2D66
#define _TX2B2D67 C1TX2B4bits.TX2B2D67
#define _TX2B2D70 C1TX2B4bits.TX2B2D70
#define _TX2B2D71 C1TX2B4bits.TX2B2D71
#define _TX2B2D72 C1TX2B4bits.TX2B2D72
#define _TX2B2D73 C1TX2B4bits.TX2B2D73
#define _TX2B2D74 C1TX2B4bits.TX2B2D74
#define _TX2B2D75 C1TX2B4bits.TX2B2D75
#define _TX2B2D76 C1TX2B4bits.TX2B2D76
#define _TX2B2D77 C1TX2B4bits.TX2B2D77

/* C1TX2CON */
/* Bitname _TXPRI cannot be defined because it is used by more than one SFR */
/* Bitname _TXREQ cannot be defined because it is used by more than one SFR */
/* Bitname _TXERR cannot be defined because it is used by more than one SFR */
/* Bitname _TXLARB cannot be defined because it is used by more than one SFR */
/* Bitname _TXABT cannot be defined because it is used by more than one SFR */
/* Bitname _TXPRI0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXPRI1 cannot be defined because it is used by more than one SFR */

/* C1TX1SID */
/* Bitname _TXIDE cannot be defined because it is used by more than one SFR */
/* Bitname _SRR cannot be defined because it is used by more than one SFR */
/* Bitname _SID0 cannot be defined because it is used by more than one SFR */
/* Bitname _SID1 cannot be defined because it is used by more than one SFR */
/* Bitname _SID2 cannot be defined because it is used by more than one SFR */
/* Bitname _SID3 cannot be defined because it is used by more than one SFR */
/* Bitname _SID4 cannot be defined because it is used by more than one SFR */
/* Bitname _SID5 cannot be defined because it is used by more than one SFR */
/* Bitname _SID6 cannot be defined because it is used by more than one SFR */
/* Bitname _SID7 cannot be defined because it is used by more than one SFR */
/* Bitname _SID8 cannot be defined because it is used by more than one SFR */
/* Bitname _SID9 cannot be defined because it is used by more than one SFR */
/* Bitname _SID10 cannot be defined because it is used by more than one SFR */
/* Bitname _SID5_0 cannot be defined because it is used by more than one SFR */
/* Bitname _SID10_6 cannot be defined because it is used by more than one SFR */

/* C1TX1EID */
/* Bitname _EID6 cannot be defined because it is used by more than one SFR */
/* Bitname _EID7 cannot be defined because it is used by more than one SFR */
/* Bitname _EID8 cannot be defined because it is used by more than one SFR */
/* Bitname _EID9 cannot be defined because it is used by more than one SFR */
/* Bitname _EID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID11 cannot be defined because it is used by more than one SFR */
/* Bitname _EID12 cannot be defined because it is used by more than one SFR */
/* Bitname _EID13 cannot be defined because it is used by more than one SFR */
/* Bitname _EID14 cannot be defined because it is used by more than one SFR */
/* Bitname _EID15 cannot be defined because it is used by more than one SFR */
/* Bitname _EID16 cannot be defined because it is used by more than one SFR */
/* Bitname _EID17 cannot be defined because it is used by more than one SFR */
/* Bitname _EID13_6 cannot be defined because it is used by more than one SFR */
/* Bitname _EID17_14 cannot be defined because it is used by more than one SFR */

/* C1TX1DLC */
/* Bitname _DLC cannot be defined because it is used by more than one SFR */
/* Bitname _TXRB0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXRB1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXRTR cannot be defined because it is used by more than one SFR */
/* Bitname _EID0 cannot be defined because it is used by more than one SFR */
/* Bitname _EID1 cannot be defined because it is used by more than one SFR */
/* Bitname _EID2 cannot be defined because it is used by more than one SFR */
/* Bitname _EID3 cannot be defined because it is used by more than one SFR */
/* Bitname _EID4 cannot be defined because it is used by more than one SFR */
/* Bitname _EID5 cannot be defined because it is used by more than one SFR */
/* Bitname _EID5_0 cannot be defined because it is used by more than one SFR */
/* Bitname _DLC0 cannot be defined because it is used by more than one SFR */
/* Bitname _DLC1 cannot be defined because it is used by more than one SFR */
/* Bitname _DLC2 cannot be defined because it is used by more than one SFR */
/* Bitname _DLC3 cannot be defined because it is used by more than one SFR */

/* C1TX1B1 */
/* Bitname _TXB1D00 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB1D01 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB1D02 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB1D03 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB1D04 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB1D05 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB1D06 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB1D07 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB1D10 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB1D11 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB1D12 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB1D13 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB1D14 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB1D15 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB1D16 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB1D17 cannot be defined because it is used by more than one SFR */

