MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F6011/mcu.h
#define _C1TX1B1_TXB1D04_POSITION                0x00000004
#define _C1TX1B1_TXB1D04_MASK                    0x00000010
#define _C1TX1B1_TXB1D04_LENGTH                  0x00000001

#define _C1TX1B1_TXB1D05_POSITION                0x00000005
#define _C1TX1B1_TXB1D05_MASK                    0x00000020
#define _C1TX1B1_TXB1D05_LENGTH                  0x00000001

#define _C1TX1B1_TXB1D06_POSITION                0x00000006
#define _C1TX1B1_TXB1D06_MASK                    0x00000040
#define _C1TX1B1_TXB1D06_LENGTH                  0x00000001

#define _C1TX1B1_TXB1D07_POSITION                0x00000007
#define _C1TX1B1_TXB1D07_MASK                    0x00000080
#define _C1TX1B1_TXB1D07_LENGTH                  0x00000001

#define _C1TX1B1_TXB1D10_POSITION                0x00000008
#define _C1TX1B1_TXB1D10_MASK                    0x00000100
#define _C1TX1B1_TXB1D10_LENGTH                  0x00000001

#define _C1TX1B1_TXB1D11_POSITION                0x00000009
#define _C1TX1B1_TXB1D11_MASK                    0x00000200
#define _C1TX1B1_TXB1D11_LENGTH                  0x00000001

#define _C1TX1B1_TXB1D12_POSITION                0x0000000A
#define _C1TX1B1_TXB1D12_MASK                    0x00000400
#define _C1TX1B1_TXB1D12_LENGTH                  0x00000001

#define _C1TX1B1_TXB1D13_POSITION                0x0000000B
#define _C1TX1B1_TXB1D13_MASK                    0x00000800
#define _C1TX1B1_TXB1D13_LENGTH                  0x00000001

#define _C1TX1B1_TXB1D14_POSITION                0x0000000C
#define _C1TX1B1_TXB1D14_MASK                    0x00001000
#define _C1TX1B1_TXB1D14_LENGTH                  0x00000001

#define _C1TX1B1_TXB1D15_POSITION                0x0000000D
#define _C1TX1B1_TXB1D15_MASK                    0x00002000
#define _C1TX1B1_TXB1D15_LENGTH                  0x00000001

#define _C1TX1B1_TXB1D16_POSITION                0x0000000E
#define _C1TX1B1_TXB1D16_MASK                    0x00004000
#define _C1TX1B1_TXB1D16_LENGTH                  0x00000001

#define _C1TX1B1_TXB1D17_POSITION                0x0000000F
#define _C1TX1B1_TXB1D17_MASK                    0x00008000
#define _C1TX1B1_TXB1D17_LENGTH                  0x00000001

#define _C1TX1B2_TXB1D20_POSITION                0x00000000
#define _C1TX1B2_TXB1D20_MASK                    0x00000001
#define _C1TX1B2_TXB1D20_LENGTH                  0x00000001

#define _C1TX1B2_TXB1D21_POSITION                0x00000001
#define _C1TX1B2_TXB1D21_MASK                    0x00000002
#define _C1TX1B2_TXB1D21_LENGTH                  0x00000001

#define _C1TX1B2_TXB1D22_POSITION                0x00000002
#define _C1TX1B2_TXB1D22_MASK                    0x00000004
#define _C1TX1B2_TXB1D22_LENGTH                  0x00000001

#define _C1TX1B2_TXB1D23_POSITION                0x00000003
#define _C1TX1B2_TXB1D23_MASK                    0x00000008
#define _C1TX1B2_TXB1D23_LENGTH                  0x00000001

#define _C1TX1B2_TXB1D24_POSITION                0x00000004
#define _C1TX1B2_TXB1D24_MASK                    0x00000010
#define _C1TX1B2_TXB1D24_LENGTH                  0x00000001

#define _C1TX1B2_TXB1D25_POSITION                0x00000005
#define _C1TX1B2_TXB1D25_MASK                    0x00000020
#define _C1TX1B2_TXB1D25_LENGTH                  0x00000001

#define _C1TX1B2_TXB1D26_POSITION                0x00000006
#define _C1TX1B2_TXB1D26_MASK                    0x00000040
#define _C1TX1B2_TXB1D26_LENGTH                  0x00000001

#define _C1TX1B2_TXB1D27_POSITION                0x00000007
#define _C1TX1B2_TXB1D27_MASK                    0x00000080
#define _C1TX1B2_TXB1D27_LENGTH                  0x00000001

#define _C1TX1B2_TXB1D30_POSITION                0x00000008
#define _C1TX1B2_TXB1D30_MASK                    0x00000100
#define _C1TX1B2_TXB1D30_LENGTH                  0x00000001

#define _C1TX1B2_TXB1D31_POSITION                0x00000009
#define _C1TX1B2_TXB1D31_MASK                    0x00000200
#define _C1TX1B2_TXB1D31_LENGTH                  0x00000001

#define _C1TX1B2_TXB1D32_POSITION                0x0000000A
#define _C1TX1B2_TXB1D32_MASK                    0x00000400
#define _C1TX1B2_TXB1D32_LENGTH                  0x00000001

#define _C1TX1B2_TXB1D33_POSITION                0x0000000B
#define _C1TX1B2_TXB1D33_MASK                    0x00000800
#define _C1TX1B2_TXB1D33_LENGTH                  0x00000001

#define _C1TX1B2_TXB1D34_POSITION                0x0000000C
#define _C1TX1B2_TXB1D34_MASK                    0x00001000
#define _C1TX1B2_TXB1D34_LENGTH                  0x00000001

#define _C1TX1B2_TXB1D35_POSITION                0x0000000D
#define _C1TX1B2_TXB1D35_MASK                    0x00002000
#define _C1TX1B2_TXB1D35_LENGTH                  0x00000001

#define _C1TX1B2_TXB1D36_POSITION                0x0000000E
#define _C1TX1B2_TXB1D36_MASK                    0x00004000
#define _C1TX1B2_TXB1D36_LENGTH                  0x00000001

#define _C1TX1B2_TXB1D37_POSITION                0x0000000F
#define _C1TX1B2_TXB1D37_MASK                    0x00008000
#define _C1TX1B2_TXB1D37_LENGTH                  0x00000001

#define _C1TX1B3_TXB1D40_POSITION                0x00000000
#define _C1TX1B3_TXB1D40_MASK                    0x00000001
#define _C1TX1B3_TXB1D40_LENGTH                  0x00000001

#define _C1TX1B3_TXB1D41_POSITION                0x00000001
#define _C1TX1B3_TXB1D41_MASK                    0x00000002
#define _C1TX1B3_TXB1D41_LENGTH                  0x00000001

#define _C1TX1B3_TXB1D42_POSITION                0x00000002
#define _C1TX1B3_TXB1D42_MASK                    0x00000004
#define _C1TX1B3_TXB1D42_LENGTH                  0x00000001

#define _C1TX1B3_TXB1D43_POSITION                0x00000003
#define _C1TX1B3_TXB1D43_MASK                    0x00000008
#define _C1TX1B3_TXB1D43_LENGTH                  0x00000001

#define _C1TX1B3_TXB1D44_POSITION                0x00000004
#define _C1TX1B3_TXB1D44_MASK                    0x00000010
#define _C1TX1B3_TXB1D44_LENGTH                  0x00000001

#define _C1TX1B3_TXB1D45_POSITION                0x00000005
#define _C1TX1B3_TXB1D45_MASK                    0x00000020
#define _C1TX1B3_TXB1D45_LENGTH                  0x00000001

