MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F6011/mcu.h
#define _C1TX0B3_TXB0D57_POSITION                0x0000000F
#define _C1TX0B3_TXB0D57_MASK                    0x00008000
#define _C1TX0B3_TXB0D57_LENGTH                  0x00000001

#define _C1TX0B4_TXB0D60_POSITION                0x00000000
#define _C1TX0B4_TXB0D60_MASK                    0x00000001
#define _C1TX0B4_TXB0D60_LENGTH                  0x00000001

#define _C1TX0B4_TXB0D61_POSITION                0x00000001
#define _C1TX0B4_TXB0D61_MASK                    0x00000002
#define _C1TX0B4_TXB0D61_LENGTH                  0x00000001

#define _C1TX0B4_TXB0D62_POSITION                0x00000002
#define _C1TX0B4_TXB0D62_MASK                    0x00000004
#define _C1TX0B4_TXB0D62_LENGTH                  0x00000001

#define _C1TX0B4_TXB0D63_POSITION                0x00000003
#define _C1TX0B4_TXB0D63_MASK                    0x00000008
#define _C1TX0B4_TXB0D63_LENGTH                  0x00000001

#define _C1TX0B4_TXB0D64_POSITION                0x00000004
#define _C1TX0B4_TXB0D64_MASK                    0x00000010
#define _C1TX0B4_TXB0D64_LENGTH                  0x00000001

#define _C1TX0B4_TXB0D65_POSITION                0x00000005
#define _C1TX0B4_TXB0D65_MASK                    0x00000020
#define _C1TX0B4_TXB0D65_LENGTH                  0x00000001

#define _C1TX0B4_TXB0D66_POSITION                0x00000006
#define _C1TX0B4_TXB0D66_MASK                    0x00000040
#define _C1TX0B4_TXB0D66_LENGTH                  0x00000001

#define _C1TX0B4_TXB0D67_POSITION                0x00000007
#define _C1TX0B4_TXB0D67_MASK                    0x00000080
#define _C1TX0B4_TXB0D67_LENGTH                  0x00000001

#define _C1TX0B4_TXB0D70_POSITION                0x00000008
#define _C1TX0B4_TXB0D70_MASK                    0x00000100
#define _C1TX0B4_TXB0D70_LENGTH                  0x00000001

#define _C1TX0B4_TXB0D71_POSITION                0x00000009
#define _C1TX0B4_TXB0D71_MASK                    0x00000200
#define _C1TX0B4_TXB0D71_LENGTH                  0x00000001

#define _C1TX0B4_TXB0D72_POSITION                0x0000000A
#define _C1TX0B4_TXB0D72_MASK                    0x00000400
#define _C1TX0B4_TXB0D72_LENGTH                  0x00000001

#define _C1TX0B4_TXB0D73_POSITION                0x0000000B
#define _C1TX0B4_TXB0D73_MASK                    0x00000800
#define _C1TX0B4_TXB0D73_LENGTH                  0x00000001

#define _C1TX0B4_TXB0D74_POSITION                0x0000000C
#define _C1TX0B4_TXB0D74_MASK                    0x00001000
#define _C1TX0B4_TXB0D74_LENGTH                  0x00000001

#define _C1TX0B4_TXB0D75_POSITION                0x0000000D
#define _C1TX0B4_TXB0D75_MASK                    0x00002000
#define _C1TX0B4_TXB0D75_LENGTH                  0x00000001

#define _C1TX0B4_TXB0D76_POSITION                0x0000000E
#define _C1TX0B4_TXB0D76_MASK                    0x00004000
#define _C1TX0B4_TXB0D76_LENGTH                  0x00000001

#define _C1TX0B4_TXB0D77_POSITION                0x0000000F
#define _C1TX0B4_TXB0D77_MASK                    0x00008000
#define _C1TX0B4_TXB0D77_LENGTH                  0x00000001

#define _C1TX0CON_TXPRI_POSITION                 0x00000000
#define _C1TX0CON_TXPRI_MASK                     0x00000003
#define _C1TX0CON_TXPRI_LENGTH                   0x00000002

#define _C1TX0CON_TXREQ_POSITION                 0x00000003
#define _C1TX0CON_TXREQ_MASK                     0x00000008
#define _C1TX0CON_TXREQ_LENGTH                   0x00000001

#define _C1TX0CON_TXERR_POSITION                 0x00000004
#define _C1TX0CON_TXERR_MASK                     0x00000010
#define _C1TX0CON_TXERR_LENGTH                   0x00000001

#define _C1TX0CON_TXLARB_POSITION                0x00000005
#define _C1TX0CON_TXLARB_MASK                    0x00000020
#define _C1TX0CON_TXLARB_LENGTH                  0x00000001

#define _C1TX0CON_TXABT_POSITION                 0x00000006
#define _C1TX0CON_TXABT_MASK                     0x00000040
#define _C1TX0CON_TXABT_LENGTH                   0x00000001

#define _C1TX0CON_TXPRI0_POSITION                0x00000000
#define _C1TX0CON_TXPRI0_MASK                    0x00000001
#define _C1TX0CON_TXPRI0_LENGTH                  0x00000001

#define _C1TX0CON_TXPRI1_POSITION                0x00000001
#define _C1TX0CON_TXPRI1_MASK                    0x00000002
#define _C1TX0CON_TXPRI1_LENGTH                  0x00000001

#define _C1RX1SID_RXIDE_POSITION                 0x00000000
#define _C1RX1SID_RXIDE_MASK                     0x00000001
#define _C1RX1SID_RXIDE_LENGTH                   0x00000001

#define _C1RX1SID_SRR_POSITION                   0x00000001
#define _C1RX1SID_SRR_MASK                       0x00000002
#define _C1RX1SID_SRR_LENGTH                     0x00000001

#define _C1RX1SID_SID0_POSITION                  0x00000002
#define _C1RX1SID_SID0_MASK                      0x00000004
#define _C1RX1SID_SID0_LENGTH                    0x00000001

#define _C1RX1SID_SID1_POSITION                  0x00000003
#define _C1RX1SID_SID1_MASK                      0x00000008
#define _C1RX1SID_SID1_LENGTH                    0x00000001

#define _C1RX1SID_SID2_POSITION                  0x00000004
#define _C1RX1SID_SID2_MASK                      0x00000010
#define _C1RX1SID_SID2_LENGTH                    0x00000001

#define _C1RX1SID_SID3_POSITION                  0x00000005
#define _C1RX1SID_SID3_MASK                      0x00000020
#define _C1RX1SID_SID3_LENGTH                    0x00000001

#define _C1RX1SID_SID4_POSITION                  0x00000006
#define _C1RX1SID_SID4_MASK                      0x00000040
#define _C1RX1SID_SID4_LENGTH                    0x00000001

#define _C1RX1SID_SID5_POSITION                  0x00000007
#define _C1RX1SID_SID5_MASK                      0x00000080
#define _C1RX1SID_SID5_LENGTH                    0x00000001

#define _C1RX1SID_SID6_POSITION                  0x00000008
#define _C1RX1SID_SID6_MASK                      0x00000100
#define _C1RX1SID_SID6_LENGTH                    0x00000001

#define _C1RX1SID_SID7_POSITION                  0x00000009
#define _C1RX1SID_SID7_MASK                      0x00000200
#define _C1RX1SID_SID7_LENGTH                    0x00000001

#define _C1RX1SID_SID8_POSITION                  0x0000000A
#define _C1RX1SID_SID8_MASK                      0x00000400
#define _C1RX1SID_SID8_LENGTH                    0x00000001

#define _C1RX1SID_SID9_POSITION                  0x0000000B
#define _C1RX1SID_SID9_MASK                      0x00000800
#define _C1RX1SID_SID9_LENGTH                    0x00000001

#define _C1RX1SID_SID10_POSITION                 0x0000000C
#define _C1RX1SID_SID10_MASK                     0x00001000
#define _C1RX1SID_SID10_LENGTH                   0x00000001

