MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F6011/mcu.h
#define _C2TX2B1_TXB2D00_POSITION                0x00000000
#define _C2TX2B1_TXB2D00_MASK                    0x00000001
#define _C2TX2B1_TXB2D00_LENGTH                  0x00000001

#define _C2TX2B1_TXB2D01_POSITION                0x00000001
#define _C2TX2B1_TXB2D01_MASK                    0x00000002
#define _C2TX2B1_TXB2D01_LENGTH                  0x00000001

#define _C2TX2B1_TXB2D02_POSITION                0x00000002
#define _C2TX2B1_TXB2D02_MASK                    0x00000004
#define _C2TX2B1_TXB2D02_LENGTH                  0x00000001

#define _C2TX2B1_TXB2D03_POSITION                0x00000003
#define _C2TX2B1_TXB2D03_MASK                    0x00000008
#define _C2TX2B1_TXB2D03_LENGTH                  0x00000001

#define _C2TX2B1_TXB2D04_POSITION                0x00000004
#define _C2TX2B1_TXB2D04_MASK                    0x00000010
#define _C2TX2B1_TXB2D04_LENGTH                  0x00000001

#define _C2TX2B1_TXB2D05_POSITION                0x00000005
#define _C2TX2B1_TXB2D05_MASK                    0x00000020
#define _C2TX2B1_TXB2D05_LENGTH                  0x00000001

#define _C2TX2B1_TXB2D06_POSITION                0x00000006
#define _C2TX2B1_TXB2D06_MASK                    0x00000040
#define _C2TX2B1_TXB2D06_LENGTH                  0x00000001

#define _C2TX2B1_TXB2D07_POSITION                0x00000007
#define _C2TX2B1_TXB2D07_MASK                    0x00000080
#define _C2TX2B1_TXB2D07_LENGTH                  0x00000001

#define _C2TX2B1_TXB2D10_POSITION                0x00000008
#define _C2TX2B1_TXB2D10_MASK                    0x00000100
#define _C2TX2B1_TXB2D10_LENGTH                  0x00000001

#define _C2TX2B1_TXB2D11_POSITION                0x00000009
#define _C2TX2B1_TXB2D11_MASK                    0x00000200
#define _C2TX2B1_TXB2D11_LENGTH                  0x00000001

#define _C2TX2B1_TXB2D12_POSITION                0x0000000A
#define _C2TX2B1_TXB2D12_MASK                    0x00000400
#define _C2TX2B1_TXB2D12_LENGTH                  0x00000001

#define _C2TX2B1_TXB2D13_POSITION                0x0000000B
#define _C2TX2B1_TXB2D13_MASK                    0x00000800
#define _C2TX2B1_TXB2D13_LENGTH                  0x00000001

#define _C2TX2B1_TXB2D14_POSITION                0x0000000C
#define _C2TX2B1_TXB2D14_MASK                    0x00001000
#define _C2TX2B1_TXB2D14_LENGTH                  0x00000001

#define _C2TX2B1_TXB2D15_POSITION                0x0000000D
#define _C2TX2B1_TXB2D15_MASK                    0x00002000
#define _C2TX2B1_TXB2D15_LENGTH                  0x00000001

#define _C2TX2B1_TXB2D16_POSITION                0x0000000E
#define _C2TX2B1_TXB2D16_MASK                    0x00004000
#define _C2TX2B1_TXB2D16_LENGTH                  0x00000001

#define _C2TX2B1_TXB2D17_POSITION                0x0000000F
#define _C2TX2B1_TXB2D17_MASK                    0x00008000
#define _C2TX2B1_TXB2D17_LENGTH                  0x00000001

#define _C2TX2B2_TXB2D20_POSITION                0x00000000
#define _C2TX2B2_TXB2D20_MASK                    0x00000001
#define _C2TX2B2_TXB2D20_LENGTH                  0x00000001

#define _C2TX2B2_TXB2D21_POSITION                0x00000001
#define _C2TX2B2_TXB2D21_MASK                    0x00000002
#define _C2TX2B2_TXB2D21_LENGTH                  0x00000001

#define _C2TX2B2_TXB2D22_POSITION                0x00000002
#define _C2TX2B2_TXB2D22_MASK                    0x00000004
#define _C2TX2B2_TXB2D22_LENGTH                  0x00000001

#define _C2TX2B2_TXB2D23_POSITION                0x00000003
#define _C2TX2B2_TXB2D23_MASK                    0x00000008
#define _C2TX2B2_TXB2D23_LENGTH                  0x00000001

#define _C2TX2B2_TXB2D24_POSITION                0x00000004
#define _C2TX2B2_TXB2D24_MASK                    0x00000010
#define _C2TX2B2_TXB2D24_LENGTH                  0x00000001

#define _C2TX2B2_TXB2D25_POSITION                0x00000005
#define _C2TX2B2_TXB2D25_MASK                    0x00000020
#define _C2TX2B2_TXB2D25_LENGTH                  0x00000001

#define _C2TX2B2_TXB2D26_POSITION                0x00000006
#define _C2TX2B2_TXB2D26_MASK                    0x00000040
#define _C2TX2B2_TXB2D26_LENGTH                  0x00000001

#define _C2TX2B2_TXB2D27_POSITION                0x00000007
#define _C2TX2B2_TXB2D27_MASK                    0x00000080
#define _C2TX2B2_TXB2D27_LENGTH                  0x00000001

#define _C2TX2B2_TXB2D30_POSITION                0x00000008
#define _C2TX2B2_TXB2D30_MASK                    0x00000100
#define _C2TX2B2_TXB2D30_LENGTH                  0x00000001

#define _C2TX2B2_TXB2D31_POSITION                0x00000009
#define _C2TX2B2_TXB2D31_MASK                    0x00000200
#define _C2TX2B2_TXB2D31_LENGTH                  0x00000001

#define _C2TX2B2_TXB2D32_POSITION                0x0000000A
#define _C2TX2B2_TXB2D32_MASK                    0x00000400
#define _C2TX2B2_TXB2D32_LENGTH                  0x00000001

#define _C2TX2B2_TXB2D33_POSITION                0x0000000B
#define _C2TX2B2_TXB2D33_MASK                    0x00000800
#define _C2TX2B2_TXB2D33_LENGTH                  0x00000001

#define _C2TX2B2_TXB2D34_POSITION                0x0000000C
#define _C2TX2B2_TXB2D34_MASK                    0x00001000
#define _C2TX2B2_TXB2D34_LENGTH                  0x00000001

#define _C2TX2B2_TXB2D35_POSITION                0x0000000D
#define _C2TX2B2_TXB2D35_MASK                    0x00002000
#define _C2TX2B2_TXB2D35_LENGTH                  0x00000001

#define _C2TX2B2_TXB2D36_POSITION                0x0000000E
#define _C2TX2B2_TXB2D36_MASK                    0x00004000
#define _C2TX2B2_TXB2D36_LENGTH                  0x00000001

#define _C2TX2B2_TXB2D37_POSITION                0x0000000F
#define _C2TX2B2_TXB2D37_MASK                    0x00008000
#define _C2TX2B2_TXB2D37_LENGTH                  0x00000001

#define _C2TX2B3_TXB2D40_POSITION                0x00000000
#define _C2TX2B3_TXB2D40_MASK                    0x00000001
#define _C2TX2B3_TXB2D40_LENGTH                  0x00000001

#define _C2TX2B3_TXB2D41_POSITION                0x00000001
#define _C2TX2B3_TXB2D41_MASK                    0x00000002
#define _C2TX2B3_TXB2D41_LENGTH                  0x00000001

