MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F6011/mcu.h
#define _C2RX0B2_TXB0D33_POSITION                0x0000000B
#define _C2RX0B2_TXB0D33_MASK                    0x00000800
#define _C2RX0B2_TXB0D33_LENGTH                  0x00000001

#define _C2RX0B2_TXB0D34_POSITION                0x0000000C
#define _C2RX0B2_TXB0D34_MASK                    0x00001000
#define _C2RX0B2_TXB0D34_LENGTH                  0x00000001

#define _C2RX0B2_TXB0D35_POSITION                0x0000000D
#define _C2RX0B2_TXB0D35_MASK                    0x00002000
#define _C2RX0B2_TXB0D35_LENGTH                  0x00000001

#define _C2RX0B2_TXB0D36_POSITION                0x0000000E
#define _C2RX0B2_TXB0D36_MASK                    0x00004000
#define _C2RX0B2_TXB0D36_LENGTH                  0x00000001

#define _C2RX0B2_TXB0D37_POSITION                0x0000000F
#define _C2RX0B2_TXB0D37_MASK                    0x00008000
#define _C2RX0B2_TXB0D37_LENGTH                  0x00000001

#define _C2RX0B3_TXB0D40_POSITION                0x00000000
#define _C2RX0B3_TXB0D40_MASK                    0x00000001
#define _C2RX0B3_TXB0D40_LENGTH                  0x00000001

#define _C2RX0B3_TXB0D41_POSITION                0x00000001
#define _C2RX0B3_TXB0D41_MASK                    0x00000002
#define _C2RX0B3_TXB0D41_LENGTH                  0x00000001

#define _C2RX0B3_TXB0D42_POSITION                0x00000002
#define _C2RX0B3_TXB0D42_MASK                    0x00000004
#define _C2RX0B3_TXB0D42_LENGTH                  0x00000001

#define _C2RX0B3_TXB0D43_POSITION                0x00000003
#define _C2RX0B3_TXB0D43_MASK                    0x00000008
#define _C2RX0B3_TXB0D43_LENGTH                  0x00000001

#define _C2RX0B3_TXB0D44_POSITION                0x00000004
#define _C2RX0B3_TXB0D44_MASK                    0x00000010
#define _C2RX0B3_TXB0D44_LENGTH                  0x00000001

#define _C2RX0B3_TXB0D45_POSITION                0x00000005
#define _C2RX0B3_TXB0D45_MASK                    0x00000020
#define _C2RX0B3_TXB0D45_LENGTH                  0x00000001

#define _C2RX0B3_TXB0D46_POSITION                0x00000006
#define _C2RX0B3_TXB0D46_MASK                    0x00000040
#define _C2RX0B3_TXB0D46_LENGTH                  0x00000001

#define _C2RX0B3_TXB0D47_POSITION                0x00000007
#define _C2RX0B3_TXB0D47_MASK                    0x00000080
#define _C2RX0B3_TXB0D47_LENGTH                  0x00000001

#define _C2RX0B3_TXB0D50_POSITION                0x00000008
#define _C2RX0B3_TXB0D50_MASK                    0x00000100
#define _C2RX0B3_TXB0D50_LENGTH                  0x00000001

#define _C2RX0B3_TXB0D51_POSITION                0x00000009
#define _C2RX0B3_TXB0D51_MASK                    0x00000200
#define _C2RX0B3_TXB0D51_LENGTH                  0x00000001

#define _C2RX0B3_TXB0D52_POSITION                0x0000000A
#define _C2RX0B3_TXB0D52_MASK                    0x00000400
#define _C2RX0B3_TXB0D52_LENGTH                  0x00000001

#define _C2RX0B3_TXB0D53_POSITION                0x0000000B
#define _C2RX0B3_TXB0D53_MASK                    0x00000800
#define _C2RX0B3_TXB0D53_LENGTH                  0x00000001

#define _C2RX0B3_TXB0D54_POSITION                0x0000000C
#define _C2RX0B3_TXB0D54_MASK                    0x00001000
#define _C2RX0B3_TXB0D54_LENGTH                  0x00000001

#define _C2RX0B3_TXB0D55_POSITION                0x0000000D
#define _C2RX0B3_TXB0D55_MASK                    0x00002000
#define _C2RX0B3_TXB0D55_LENGTH                  0x00000001

#define _C2RX0B3_TXB0D56_POSITION                0x0000000E
#define _C2RX0B3_TXB0D56_MASK                    0x00004000
#define _C2RX0B3_TXB0D56_LENGTH                  0x00000001

#define _C2RX0B3_TXB0D57_POSITION                0x0000000F
#define _C2RX0B3_TXB0D57_MASK                    0x00008000
#define _C2RX0B3_TXB0D57_LENGTH                  0x00000001

#define _C2RX0B4_TXB0D60_POSITION                0x00000000
#define _C2RX0B4_TXB0D60_MASK                    0x00000001
#define _C2RX0B4_TXB0D60_LENGTH                  0x00000001

#define _C2RX0B4_TXB0D61_POSITION                0x00000001
#define _C2RX0B4_TXB0D61_MASK                    0x00000002
#define _C2RX0B4_TXB0D61_LENGTH                  0x00000001

#define _C2RX0B4_TXB0D62_POSITION                0x00000002
#define _C2RX0B4_TXB0D62_MASK                    0x00000004
#define _C2RX0B4_TXB0D62_LENGTH                  0x00000001

#define _C2RX0B4_TXB0D63_POSITION                0x00000003
#define _C2RX0B4_TXB0D63_MASK                    0x00000008
#define _C2RX0B4_TXB0D63_LENGTH                  0x00000001

#define _C2RX0B4_TXB0D64_POSITION                0x00000004
#define _C2RX0B4_TXB0D64_MASK                    0x00000010
#define _C2RX0B4_TXB0D64_LENGTH                  0x00000001

#define _C2RX0B4_TXB0D65_POSITION                0x00000005
#define _C2RX0B4_TXB0D65_MASK                    0x00000020
#define _C2RX0B4_TXB0D65_LENGTH                  0x00000001

#define _C2RX0B4_TXB0D66_POSITION                0x00000006
#define _C2RX0B4_TXB0D66_MASK                    0x00000040
#define _C2RX0B4_TXB0D66_LENGTH                  0x00000001

#define _C2RX0B4_TXB0D67_POSITION                0x00000007
#define _C2RX0B4_TXB0D67_MASK                    0x00000080
#define _C2RX0B4_TXB0D67_LENGTH                  0x00000001

#define _C2RX0B4_TXB0D70_POSITION                0x00000008
#define _C2RX0B4_TXB0D70_MASK                    0x00000100
#define _C2RX0B4_TXB0D70_LENGTH                  0x00000001

#define _C2RX0B4_TXB0D71_POSITION                0x00000009
#define _C2RX0B4_TXB0D71_MASK                    0x00000200
#define _C2RX0B4_TXB0D71_LENGTH                  0x00000001

#define _C2RX0B4_TXB0D72_POSITION                0x0000000A
#define _C2RX0B4_TXB0D72_MASK                    0x00000400
#define _C2RX0B4_TXB0D72_LENGTH                  0x00000001

#define _C2RX0B4_TXB0D73_POSITION                0x0000000B
#define _C2RX0B4_TXB0D73_MASK                    0x00000800
#define _C2RX0B4_TXB0D73_LENGTH                  0x00000001

#define _C2RX0B4_TXB0D74_POSITION                0x0000000C
#define _C2RX0B4_TXB0D74_MASK                    0x00001000
#define _C2RX0B4_TXB0D74_LENGTH                  0x00000001

#define _C2RX0B4_TXB0D75_POSITION                0x0000000D
#define _C2RX0B4_TXB0D75_MASK                    0x00002000
#define _C2RX0B4_TXB0D75_LENGTH                  0x00000001

#define _C2RX0B4_TXB0D76_POSITION                0x0000000E
#define _C2RX0B4_TXB0D76_MASK                    0x00004000
#define _C2RX0B4_TXB0D76_LENGTH                  0x00000001

#define _C2RX0B4_TXB0D77_POSITION                0x0000000F
#define _C2RX0B4_TXB0D77_MASK                    0x00008000
#define _C2RX0B4_TXB0D77_LENGTH                  0x00000001

#define _C2RX0CON_FILHIT0_POSITION               0x00000000
#define _C2RX0CON_FILHIT0_MASK                   0x00000001
#define _C2RX0CON_FILHIT0_LENGTH                 0x00000001

